package by.teachmeskills.lesson5.cycle;

public class Additional2 {

    public static void main(String[] args)

            // Дополнительное задание : 2. Напишите программу, которая выводит на консоль таблицу умножения.

    {

        for ( int a = 1; a <= 10; ++a )

        {


            for ( int b = 1; b <= 10; ++b )

            {
                System.out.println( a + " * " + b + " = " + a * b );
            }


        }


    }


}
