package by.teachmeskills.lesson5.cycle;

public class Task6 {

    public static void main(String[] args)

            // 6. Составьте программу, выводящую на экран квадраты чисел от 10 до 20 включительно.

    {


        for ( int a = 10; a <= 20; ++a)

        {
            System.out.println(a * a);
        }


    }


}
