# TMS-Android

Group: AN12-onl
-
Student: Egiazaryan Gor
-
---

Home work #2 Git
-
1. (Кто не сделал) Завести удалённый репозиторий Github.

2. (Кто не сделал) Инициализировать локальный git репозиторий внутри проекта, который создали на первом уроке.

3. Добавить меня в Collaborators своего репозитория в Github. (zhukov.anton.02@gmail.com ИЛИ ZhukovAnton).

4. Сделать коммит и запушить в свой репозиторий все локальные изменения в ветке main.

5. От ветки main сделать новую ветку hw/2.

6. В ней добавить в README.md файл номер группы, фио, условие домашней работы. (Методичка по markdown https://paulradzkov.com/2014/markdown_cheatsheet/).

7. Сделать незначительное изменение в файле Main.java (обернуть System.out.println команду пустыми строчками например).

8. Сделать коммит и пуш в новую удалённую ветку hw/2.

9. Из ветки hw/2 сделать Pull Request в ветку main и назначить меня в полях assignees и reviewers.

10. Скинуть ссылку на свой ПР (Pull Request) в этот чат
--- 

Home work #3 Packages
-
1. Подготовиться к опросу на следующем уроке

2. Изучить проект с примерами

3. В своём локальном проекте:
   * 3.1 Сделать ветку hw/3 от последней(!) версии ветки main
   * 3.2 Создать базовый пакет by.teachmeskills
   * 3.3 Создать в базовом пакете подпакет lesson3
   * 3.4 Переместить в lesson3 уже созданный Main.java
   * 3.5 В том же пакете описать класс Human или Animal на выбор, описать поля (произвольное количество, главное чтобы они сопоставлялись с именем и назначением класса), написать конструктор со всеми параметрами и произвольный метод
   * 3.6 Показать использование данного класса через by.teachmeskills.lesson3.Main.java
   * 3.7 Залить все изменения на гитхаб и открыть ПР
---

Home work #4 
-
Задачи:
На арифметические операторы:
1. На вход программе даётся два целых числа (a и b). Нужно вывести результат деление первого на второе и остаток от деления первого на второе.

На условные операторы:

2. Написать программу для вывода названия поры года по номеру
   месяца. (При решении используйте оператор switch-case.)

3. Написать программу для вывода названия поры года по номеру
   месяца. (При решении используйте оператор if-else-if.)

4. Напишите программу, которая будет принимать на вход число и на
   выход будет выводить сообщение четное число или нет. (Для определения четности числа используйте операцию получения остатка от деления - операция выглядит так: '% 2').

5. Для введенного числа t (температура на улице) вывести
   Если t>–5, то вывести «Тепло».
   Если –5>= t > –20, то вывести «Нормально».
   Если –20>= t, то вывести «Холодно».

6. (Дополнительная) Решить квадратное уравнение для всех случаев дискриминанта
---